#+TITLE:CthulhuMUD
* Test
:properties:
:namespace: mud.core
:end:

#+BEGIN_SRC wisp :results dynamic
;(macroexpand '(deflens bubba "" [p] #(named? %) `(lens-property ~(name prop))
;  (Lens.
;   (fn [obj] (aget obj prop))
;   (fn [obj val] (let [newObj (cond (dictionary? obj) (Object/assign (Object.) obj)
;                                    (vector? obj) (.slice obj))]
;                   (aset newObj prop val)
;                   newObj))
;   [prop])))
;(macroexpand '(lens a))
;(lens-parse 'a) 
;(.log window.console lens-parsers)
;(macroexpand '(lens ab))
;(JSON/stringify (lens-set (lens ab) {:ab 2} 3))
;(.log window.console (with-meta (with-meta (fn [] 3) {:a 1}) {:b 2}))
(Leisure/dbg) 
(let [a {:a 1}] (JSON/stringify [a (merge a {:a 2 :b 1})]))
#+END_SRC
#+RESULTS:
: [{&quot;a&quot;:1},{&quot;a&quot;:2,&quot;b&quot;:1}]



#+BEGIN_SRC wisp :results dynamicX
(transaction->
  (update (:_id 3 :name "bubba"))
  ...
  (custom frob)))
;; -> (let [t1  (Transaction.)
            t2  (update (:_id 3 :name "bubba"))
            ...
            tN  (frob tM)
            tO  (tr-check tM tN)]
            tO)
#+END_SRC

*** Examples
#+BEGIN_SRC wisp :results dynamic
(JSON/stringify (lens-set (lens a b c) {:a {:b {:c 3 :d 5} :e 7}} 4))
(JSON/stringify (lens-set (lens 0) [2 3 4] 7))
(lens-get (lens a 1) {:a [2 3 4]})
#+END_SRC
#+RESULTS:
: {&quot;a&quot;:{&quot;b&quot;:{&quot;c&quot;:4,&quot;d&quot;:5},&quot;e&quot;:7}}
: [7,3,4]
: 3
*** Tests
#+BEGIN_SRC wisp :results dynamic
;(macroexpand '(plet [[a] [1] b 2] prin a)))
(p-let [{:a fred} {:a 3} b 2] [b fred])
(macroexpand '(p-defn q [a] (print a)))
(p-defn q [[a]] (print a)) 
(map (fn [] (.log window.console arguments)) [1 2])
(q [:hello])
;(or ((pattern [fred])[ ]3 4)
;(drop 2 [1 2 3 4 5])
;(JSON/stringify (pattern-match-all (pattern [a]) 2 (pattern fred) 7))
#+END_SRC
#+RESULTS:
: hello
: 2,3
: (&#39;def &#39;q (&#39;fn &#39;q [&#39;a] (&#39;print &#39;a)))
: ,

#+BEGIN_SRC wisp :results dynamic
(= "(pattern fred)" (str (pattern fred)))
(= "(pattern \"fred\")" (str (pattern "fred")))
(= "(pattern \"fred\")" (str (pattern :fred)))
(= "(pattern \":fred\")" (str (pattern ":fred")))
(= "(pattern {:a 1})" (str (pattern {:a 1})))
(= "(pattern '(1 fred))" (str (pattern '(1 fred))))
(= "(pattern [1 fred])" (str (pattern [1 fred])))
(->boolean ((pattern {:a 1}) {:a 1}))
(not (->boolean ((pattern {:a 1}) {:a 2})))
(= 3 (aget ((pattern {:a fred}) {:a 3}) :fred))
(= 5 (aget ((pattern {:a fred}) ((pattern {:a fred}) {:a 3} {:fred 5})) :fred))
(->boolean ((pattern '(1)) '(1)))
(= 1 (aget ((pattern '(fred)) '(1)) :fred))
(= '(2) ((pattern '(fred)) '(1) {:fred 2}))
(->boolean ((pattern [1]) [1]))
(= 1 (aget ((pattern [fred]) [1]) :fred))
(= [2] ((pattern [fred]) [1] {:fred 2})) 
#+END_SRC
#+RESULTS:
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true
: true

*** Transaction macro tests
#+BEGIN_SRC wisp
(macroexpand '(transaction->))
(macroexpand '(transaction-> a))
(macroexpand '(transaction-> a b))
(macroexpand '(transaction-> a b (c d)))
(macroexpand '(do-> a b c))
(macroexpand '(transaction-> a (do-> b (c d)) e f))
#+END_SRC
#+RESULTS:
: (&#39;tr-check &#39;a &#39;transactionArrowErrMsg)
: (&#39;let [&#39;G__115 (&#39;tr-check &#39;a &#39;transactionArrowErrMsg)] (&#39;tr-check (&#39;b &#39;G__115) &#39;transactionArrowErrMsg))
: (&#39;let [&#39;G__117 (&#39;tr-check &#39;a &#39;transactionArrowErrMsg) &#39;G__118 (&#39;tr-check (&#39;b &#39;G__117) &#39;transactionArrowErrMsg)] (&#39;tr-check (&#39;c &#39;G__118 &#39;d) &#39;transactionArrowErrMsg))
: (&#39;let [&#39;G__120 &#39;a] &#39;b &#39;c &#39;G__120)
: (&#39;let [&#39;G__121 (&#39;tr-check &#39;a &#39;transactionArrowErrMsg) &#39;G__122 (&#39;tr-check (&#39;do-&gt; &#39;G__121 &#39;b (&#39;c &#39;d)) &#39;transactionArrowErrMsg) &#39;G__123 (&#39;tr-check (&#39;e &#39;G__122) &#39;transactionArrowErrMsg)] (&#39;tr-check (&#39;f &#39;G__123) &#39;transactionArrowErrMsg))

#+BEGIN_SRC wisp
debugger
(-> 33 (do-> 1 2 3) (+ 2))
#+END_SRC


#+RESULTS:
: 35
